Repository: Tereami/RebarSketch
Catalog: RebarSketch/MyStrings.*.resx
Languages: ru_ru

source: Error
ru_ru: Ошибка

# ErrorFailedToLoadSettings
source: Failed to load the settings, set default
ru_ru: Не удалось загрузить настройки, установлены по-умолчанию

# ErrorFileNotFound
source: File not found
ru_ru: Не найден файл

# ErrorFolderNotFound
source: Folder not found
ru_ru: Не найдена папка

# ErrorLibraryOldVersion
source: The library is not updated to the new XML format. Please launch the Sketch editor ot ask your BIM specialist for help.
ru_ru: Библиотека не обновлена до нового формата. Запустите Конструктор форм или обратитесь в bim-отдел

# ErrorNoFamiliesInLibrary
source: Failed to handle elements. Maybe there are families that are not prescribed in the library. Families name:
ru_ru: Не удалось обработать семейства. Скорее всего, применены семейства не из библиотеки. Имена семейств:

# ErrorNoPermission
source: Failed to save the file, check user permissions
ru_ru: Не удалось сохранить файл, проверьте права доступа

# ErrorRebarVariableLengthNoMark
source: Variable length rebars without Mark parameter are found. Please set the same Mark to the rebars that should be grouped.
ru_ru: Обнаружены арматурные стержни переменной длины, для которых не назначена Марки. Группировка для таких стержней выполняется по Марке, которую нужно назначить заранее.

source: for rebar
ru_ru: для арматуры

source: Incorrect parameter type
ru_ru: Неверный тип параметра

source: Info
ru_ru: Инфо

# MaybeUpdateFamily
source: Maybe you should update the family
ru_ru: Возможно, нужно обновить семейство

# MessageEmptyLibrary
source: The library is empty
ru_ru: Библиотека пуста

# MessageLibraryWillBeUpdated
source: The sketch library will be updated to a new format
ru_ru: Библиотека эскизов будет обновлена до нового формата

# MessageNoSelectedRows
source: Please open a Sketch schedule, select all the rows and then launch this plugin!
ru_ru: Перед запуском перейдите в Ведомость деталей, выберите все строчки и после этого запускайте плагин.

# MoreOneSubtype
source: More than 1 sketch subtype
ru_ru: Более 1 шаблона подтипа

# MoreOneTemplate
source: is in several sketch templates
ru_ru: прописана в нескольких шаблонах

source: Name is already in use!
ru_ru: Это имя уже используется!

# NewFormName
source: New sketch name:
ru_ru: Имя новой формы:

# NoSubtype
source: No subtype sketch
ru_ru: Нет шаблона подтипа

# NotFound
source: is not found in
ru_ru: не найден в

source: Parameter
ru_ru: Параметр

# ParameterSubtypeNumber
source: Rbr.FormSubtypeNumber
ru_ru: Арм.НомерПодтипаФормы

source: Rebar
ru_ru: Арматура

# RebarAparam
source: Rbr_A
ru_ru: Арм_А

source: Report
ru_ru: Отчет

# SelectImage
source: Select the image for a new sketch
ru_ru: Выберите картинку для эскиза

# TitleSketchConstructor
source: Sketch library editor. Version
ru_ru: Редактор библиотеки эскизов. Версия

# TransactionRebarSketch
source: Sketch schedule
ru_ru: Ведомость деталей
